---
kind: enumMember
id: F:Autodesk.Revit.UI.PostableCommand.AlignedToCurrentView
enum: Autodesk.Revit.UI.PostableCommand
source: html/f6ccdc1b-6ac3-9c49-d0bb-8a7d1877eab0.htm
---
# Autodesk.Revit.UI.PostableCommand.AlignedToCurrentView

Pastes elements that were cut or copied from another view into the current view.